{
  "_name_or_path": "dangvantuan/Vietnamese_impl",
  "architectures": [
    "VietnameseModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "dangvantuan/Vietnamese_impl--configuration.VietnameseConfig",
    "AutoModel": "dangvantuan/Vietnamese_impl--modeling.VietnameseModel",
    "AutoModelForMaskedLM": "dangvantuan/Vietnamese_impl--modeling.VietnameseForMaskedLM",
    "AutoModelForMultipleChoice": "dangvantuan/Vietnamese_impl--modeling.VietnameseForMultipleChoice",
    "AutoModelForQuestionAnswering": "dangvantuan/Vietnamese_impl--modeling.VietnameseForQuestionAnswering",
    "AutoModelForSequenceClassification": "dangvantuan/Vietnamese_impl--modeling.VietnameseForSequenceClassification",
    "AutoModelForTokenClassification": "dangvantuan/Vietnamese_impl--modeling.VietnameseForTokenClassification"
  },
  "classifier_dropout": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "layer_norm_type": "layer_norm",
  "logn_attention_clip1": false,
  "logn_attention_scale": false,
  "max_position_embeddings": 8192,
  "model_type": "Vietnamese",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pack_qkv": true,
  "pad_token_id": 1,
  "position_embedding_type": "rope",
  "rope_scaling": {
    "factor": 8.0,
    "type": "ntk"
  },
  "rope_theta": 20000,
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "type_vocab_size": 1,
  "unpad_inputs": false,
  "use_memory_efficient_attention": false,
  "vocab_size": 250048
}
